In [ ]:
import psycopg2 as pg
import pandas as pd

connection=pg.connect(host='pgsql-196447.vipserv.org', port=5432, dbname='wbauer_adb', user='wbauer_adb', password='adb2020')

df=pd.read_sql('select * from film',con=connection)
df

     film_id  ...                                           fulltext
0        133  ...  'chamber':1 'fate':4 'husband':11 'italian':2 ...
1        384  ...  'australia':18 'cat':8 'drama':5 'epic':4 'exp...
2          8  ...  'airport':1 'ancient':18 'confront':14 'epic':...
3         98  ...  'boat':20 'bright':1 'conquer':14 'encount':2 ...
4          1  ...  'academi':1 'battl':15 'canadian':20 'dinosaur...
..       ...  ...                                                ...
995      996  ...  'administr':12 'boat':8 'boy':17 'databas':11 ...
996      997  ...  'boat':22 'cat':11 'challeng':14 'drama':5 'ki...
997      998  ...  'boy':16 'canadian':19 'compos':8 'core':2 'fa...
998      999  ...  'ancient':19 'boat':11 'china':20 'discov':14 ...
999     1000  ...  'ark':2 'boy':12,17 'intrepid':4 'mad':8 'mona...

[1000 rows x 13 columns]

In [ ]:
#1
df=pd.read_sql_query('select count(distinct category) from film_list',con=connection)
df

   count
0     16

In [ ]:
#2
df=pd.read_sql_query('select distinct category from film_list order by category',con=connection)
df

       category
0        Action
1     Animation
2      Children
3      Classics
4        Comedy
5   Documentary
6         Drama
7        Family
8       Foreign
9         Games
10       Horror
11        Music
12          New
13       Sci-Fi
14       Sports
15       Travel

In [ ]:
#3
df_oldest=pd.read_sql_query('select release_year, title from film order by release_year asc limit 1',con=connection)
df_newest=pd.read_sql_query('select release_year, title from film order by release_year desc limit 1',con=connection)
print(df_oldest)
print("\n")
print(df_newest)

#filmy mają wpisany jedynie rok wydania stąd taki sam wynik

   release_year            title
0          2006  Chamber Italian


   release_year            title
0          2006  Chamber Italian

In [ ]:
#4
df=pd.read_sql_query("select count(*) from rental where rental_date between '2005-07-01 00:00:00'::timestamp and '2005-08-01 23:59:59'::timestamp",con=connection)
df

   count
0   7380

In [ ]:
#5
df=pd.read_sql_query("select count(*) from rental where rental_date between '2010-01-01 00:00:00'::timestamp and '2011-02-01 23:59:59'::timestamp",con=connection)
df

   count
0      0

In [ ]:
#6
df=pd.read_sql_query('select * from payment order by amount desc limit 1',con=connection)
df

   payment_id  customer_id  ...  amount               payment_date
0       20403          362  ...   11.99 2007-03-21 21:57:24.996577

[1 rows x 6 columns]

In [ ]:
#7
df=pd.read_sql_query("select * from customer_list where country='Poland' or country='Nigeria' or country='Bangladesh'",con=connection)
df

     id              name  ...   notes sid
0   284     Sonia Gregory  ...  active   1
1   318       Brian Wyman  ...  active   1
2   572   Sidney Burleson  ...  active   1
3   409    Rodney Moeller  ...  active   2
4   332    Stephen Qualls  ...  active   1
5   286       Velma Lucas  ...  active   1
6    80      Marilyn Ross  ...  active   1
7   198      Elsie Kelley  ...  active   2
8   103   Gladys Hamilton  ...  active   1
9   329    Frank Waggoner  ...  active   2
10  128   Marjorie Tucker  ...  active   1
11   18      Carol Garcia  ...  active   2
12  270       Leah Curtis  ...  active   1
13  501       Ruben Geary  ...  active   1
14  277      Olga Jimenez  ...  active   2
15  156   Bertha Ferguson  ...  active   1
16  280    Tracey Barrett  ...  active   2
17  250         Jo Fowler  ...  active   2
18  571  Johnnie Chisholm  ...  active   2
19  562     Wallace Slone  ...  active   1
20   21    Michelle Clark  ...  active   1
21  380   Russell Brinson  ...  active   1
22  558  Jimmie Eggleston  ...  active   1
23  232    Constance Reid  ...  active   2

[24 rows x 9 columns]

In [ ]:
#8
df=pd.read_sql_query('select country from staff_list',con=connection)
df

     country
0     Canada
1  Australia

In [ ]:
#9
df=pd.read_sql_query("select count(*) from staff_list where country='Argentina' or country='Spain'",con=connection)
df

   count
0      0

In [ ]:
#10
df=pd.read_sql_query("select category from sales_by_film_category where total_sales>0",con=connection)
df

       category
0        Sports
1        Sci-Fi
2     Animation
3         Drama
4        Comedy
5           New
6        Action
7       Foreign
8         Games
9        Family
10  Documentary
11       Horror
12     Classics
13     Children
14       Travel
15        Music

In [ ]:
#11
df=pd.read_sql_query("""select distinct category from film_list where fid in (select film_id from inventory where inventory_id in (select inventory_id from rental where customer_id in (select id from customer_list where country='United States')))""",con=connection)
df

       category
0        Horror
1        Sports
2      Classics
3        Action
4        Family
5        Comedy
6           New
7   Documentary
8         Drama
9         Music
10      Foreign
11     Children
12       Sci-Fi
13        Games
14    Animation
15       Travel

In [ ]:
#12
df=pd.read_sql_query("select title from film_list where actors like '%Ellen Presley%' or actors like '%Olympia Pfeiffer%' or actors like '%Julia Zellweger%'",con=connection)
df

                   title
0            Badman Dawn
1        Bilko Anonymous
2   Breakfast Goldfinger
3      Caribbean Liberty
4       Casper Dragonfly
..                   ...
64             Turn Star
65            Wait Cider
66          Women Dorado
67             Won Dares
68         Wyoming Storm

[69 rows x 1 columns]